ZetaWeb.Exchange/src/Catalogs/зс_веб_ОбъектыОбмена/зс_веб_ОбъектыОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>зс_веб_ОбъектыОбмена</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ТипОбъекта</name>
    <comment>Например, Спр, Док, ТЧ и т.д.</comment>
    <type>
      <types>EnumRef.ЗетаWEBТипыОбъектовКонфигурации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяМетаданныхНаСайте</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РодительскийОбъектОбмена</name>
    <type>
      <types>CatalogRef.зс_веб_ОбъектыОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьОбъектССайта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокВыгрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокЗагрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПланаОбмена</name>
    <type>
      <types>EnumRef.зс_веб_ИменаПлановОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектКонфигурации</name>
    <comment>Истина - объект конфигурации, ложь - объект CMS</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОбъектаКонфигурации</name>
    <comment>Нужен для перехода на новую систему обмена</comment>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчаствуетВОбмене</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаПоддержке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ZetaWeb.Exchange/src/InformationRegisters/зс_веб_ЗапросыОбъектовОбмена/зс_веб_ЗапросыОбъектовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>зс_веб_ЗапросыОбъектовОбмена</name>
  <resources>
    <name>ИмяМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РасширенныйИмпорт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьРазделителиОбмена</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗапросПолный</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ЗапросИзменения</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ЗапросРазделителиПолный</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ЗапросРазделителиИзменения</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>УсловиеРазделителяВПолномОбмене</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УсловиеРазделителяВОбменеИзменениями</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НаПоддержке</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Версия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидКонфигурации</name>
    <type>
      <types>CatalogRef.ЗетаWEBВидыКонфигураций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектОбмена</name>
    <type>
      <types>CatalogRef.зс_веб_ОбъектыОбмена</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ZetaWeb.Exchange/src/Catalogs/зс_веб_ОбъектыОбмена/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// todo
	// адаптировать загрузку внутренних данных
	
	//ПредставлениеВерсии = зс_веб_ВыгрузкаЗагрузкаВнутреннихДанныхЗетаВебСервер.ПолучитьПредставлениеНомераВерсии(Объект.Версия);
	
	зс_веб_ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Запросы, "ОбъектОбмена", Объект.Ссылка, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьДоступность();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипОбъектаПриИзменении(Элемент)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура РазрешитьРедактированиеПриИзменении(Элемент)
	
	ТекстВопроса = "Объект будет снят с поддержки. Автоматическое обновление объекта будет невозможно. Продолжить?";
	Кнопки = РежимДиалогаВопрос.ДаНет;
	ОтветПоУмолчанию = КодВозвратаДиалога.Нет;
	ПараметрыОповещения = Новый Структура;
	
	//асинхронное открытие включим в ЗВ 3.0
	//Оповещение = Новый ОписаниеОповещения("РазрешитьРедактирование", ЭтаФорма, ПараметрыОповещения);
	//
	//ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки, , ОтветПоУмолчанию);	
											
	Ответ = Вопрос(ТекстВопроса , Кнопки, 0, ОтветПоУмолчанию);
	РазрешитьРедактирование(Ответ, ПараметрыОповещения);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Запросы

&НаКлиенте
Процедура ЗапросыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	// Создание структуры значений
	СтруктураФормы = Новый Структура;
	СтруктураФормы.Вставить("ОбъектОбмена", Объект.Ссылка);
	
	// Если запись не будет найдена, вызовем заполнение измерений.
	СтруктураЗаполнения = Новый Структура;
	СтруктураЗаполнения.Вставить("ЗначенияЗаполнения", СтруктураФормы);
	
	ОткрытьФорму("РегистрСведений.зс_веб_ЗапросыОбъектовОбмена.Форма.ФормаЗаписи", СтруктураЗаполнения, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СравнитьСРелизом(Команда)
	
	// todo
	// адаптировать загрузку внутренних данных
	
	//ДанныеРелиза = зс_веб_ВыгрузкаЗагрузкаВнутреннихДанныхЗетаВебСервер.ПолучитьДанныеОбъектаИзРелиза(Строка(Объект.Ссылка.УникальныйИдентификатор()), Объект.Версия);
	//
	//ДанныеОбъекта = зс_веб_ВыгрузкаЗагрузкаВнутреннихДанныхЗетаВебСервер.ПолучитьСериализованныеДанныеОбъекта(Объект.Ссылка);
	//
	//зс_веб_ВыгрузкаЗагрузкаВнутреннихДанныхЗетаВебКлиент.СравнитьОбъекты(ДанныеРелиза, ДанныеОбъекта, "Данные релиза", "Данные объекта");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура УстановитьВидимостьДоступность()

	Если Объект.НаПоддержке Тогда
		
		ЭтаФорма.ТолькоПросмотр = Истина;
		
		РазрешитьРедактирование = Ложь;
		
		Элементы.РазрешитьРедактирование.Заголовок = "Включить возможность редактирования";
	
		Элементы.СравнитьСРелизом.Доступность = Ложь;
		
	Иначе
		
		ЭтаФорма.ТолькоПросмотр = Ложь;
		
		РазрешитьРедактирование = Истина;

		Элементы.РазрешитьРедактирование.Заголовок = "Редактирование разрешено";
		Элементы.РазрешитьРедактирование.Доступность = Ложь;
		
		Элементы.СравнитьСРелизом.Доступность = Истина;
	
	КонецЕсли;
	
КонецПроцедуры // УстановитьВидимостьДоступность()

&НаКлиенте
Процедура РазрешитьРедактирование(Результат, ПараметрыОповещения) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		
		РазрешитьРедактирование = Ложь;
		
		Возврат;
		
	КонецЕсли;
	
	Объект.НаПоддержке = Ложь;
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти
